# Nociones Básicas Python tarea
Daniel Orozco

1. Lista de 100 elementos con múltiplos de 3:

In [1]:
lista = []
a = 3
for i in range(100):
    lista.append(a)
    a = a + 3
print(lista)

[3, 6, 9, 12, 15, 18, 21, 24, 27, 30, 33, 36, 39, 42, 45, 48, 51, 54, 57, 60, 63, 66, 69, 72, 75, 78, 81, 84, 87, 90, 93, 96, 99, 102, 105, 108, 111, 114, 117, 120, 123, 126, 129, 132, 135, 138, 141, 144, 147, 150, 153, 156, 159, 162, 165, 168, 171, 174, 177, 180, 183, 186, 189, 192, 195, 198, 201, 204, 207, 210, 213, 216, 219, 222, 225, 228, 231, 234, 237, 240, 243, 246, 249, 252, 255, 258, 261, 264, 267, 270, 273, 276, 279, 282, 285, 288, 291, 294, 297, 300]

2.  Índice de masa corporal de cada persona

In [2]:
import pandas as pd

In [3]:
PE = pd.read_excel("datosPE.xlsx")

In [4]:
PE.head()

   ID Persona  Peso  Estatura
0           1    67      1.41
1           2    99      1.83
2           3    86      1.90
3           4   118      1.65
4           5   109      1.67

In [5]:
PE["IMC"] = PE["Peso"] / (PE["Estatura"])**2

In [6]:
PE.head()

   ID Persona  Peso  Estatura        IMC
0           1    67      1.41  33.700518
1           2    99      1.83  29.561946
2           3    86      1.90  23.822715
3           4   118      1.65  43.342516
4           5   109      1.67  39.083510

3. Calcular utilidad

In [7]:
CT = pd.read_excel("datosCT.xlsx")

In [8]:
CT.head()

  Unnamed: 0  Ingreso  Gasto
0      Enero     1340   1880
1    Febrero     2590   3130
2      Marzo     3570   2140
3      Abril     4450   3370
4       Mayo     1330   2990

In [9]:
CT["Utilidad"] = CT["Ingreso"] - CT["Gasto"]

In [10]:
CT.head()

  Unnamed: 0  Ingreso  Gasto  Utilidad
0      Enero     1340   1880      -540
1    Febrero     2590   3130      -540
2      Marzo     3570   2140      1430
3      Abril     4450   3370      1080
4       Mayo     1330   2990     -1660

4. Promedio de gastos en los meses que la utilidad fue negativa

In [13]:
temporal = CT[CT["Utilidad"]<0]
temporal["Gasto"].mean()

2517.1428571428573

5. Ingresos totales de todo el año

In [ ]:
CT["Ingreso"].sum()